package crocodile8.forecasts.data

import io.reactivex.Observable
import io.reactivex.schedulers.Schedulers
import java.util.concurrent.TimeUnit

/**
 * Created by Andrei Riik in 2020.
 */
class DataProvider {

    fun getForecasts(): Observable<List<Forecast>> = Observable.timer(2, TimeUnit.SECONDS)
        .observeOn(Schedulers.io())
        .map {
            listOf(
                Forecast(
                    title = "Отборочные Евро 2020",
                    time = "Сегодня 23:30",
                    who = "Россия\nГермания",
                    coefficient = "1.43",
                    belowWho = "Победа России в основное время",
                    description = "В этом разделе мы расскажем о плюсах и минусах букмекерских контор, о бонусах которые они нам предлагают. А так же Вы можете оставить свой отзыв на конкретную букмекерскую контору или посмотреть отзывы игроков. Мы рекомендуем играть в букмекерских конторах с высоким рейтингом. Наши обзоры помогут найти наиболее подходящего для вас букмекера.",
                    authorName = "Борис Борисович",
                    authorROI = "ROI 1.75%"
                ),
                Forecast(
                    title = "Отборочные",
                    time = "Завтра 23:30",
                    who = "Россия\nАнглия",
                    coefficient = "1.13",
                    belowWho = "Победа России в основное время",
                    description = "Мы расскажем о плюсах и минусах букмекерских контор, о бонусах которые они нам предлагают. А так же Вы можете оставить свой отзыв на конкретную букмекерскую контору или посмотреть отзывы игроков. Мы рекомендуем играть в букмекерских конторах с высоким рейтингом. Наши обзоры помогут найти наиболее подходящего для вас букмекера.",
                    authorName = "Артём Борисович",
                    authorROI = "ROI 1.25%"
                ),
                Forecast(
                    title = "Евро",
                    time = "Вчера 23:30",
                    who = "Россия\nАвстралия",
                    coefficient = "1.31",
                    belowWho = "Победа России",
                    description = "О бонусах которые они нам предлагают. А так же Вы можете оставить свой отзыв на конкретную букмекерскую контору или посмотреть отзывы игроков. Мы рекомендуем играть в букмекерских конторах с высоким рейтингом. Наши обзоры помогут найти наиболее подходящего для вас букмекера.",
                    authorName = "Николай Николаевич",
                    authorROI = "ROI 1.23%"
                ),
                Forecast(
                    title = "Отборочные 2020",
                    time = "Вчера 21:30",
                    who = "Россия\nДания",
                    coefficient = "1.03",
                    belowWho = "Победа Дании",
                    description = "Так же Вы можете оставить свой отзыв на конкретную букмекерскую контору или посмотреть отзывы игроков. Мы рекомендуем играть в букмекерских конторах с высоким рейтингом. Наши обзоры помогут найти наиболее подходящего для вас букмекера.",
                    authorName = "Виталий Борисович",
                    authorROI = "ROI 1.23%"
                )
            )
        }
}